/** @type {import('sequelize-cli').Migration} */
module.exports = {
  async up(queryInterface, Sequelize) {
    await queryInterface.bulkInsert('Communities', [{
      image: 'https://photo2.wambacdn.net/21/47/47/1755747412/1832025206_square.jpg?hash=PLnty8-qdB11LGr78X0BEA&expires=64060578000&updated=1516444254',
      title: '«World Class Таганский»',
      subtitle: 'Самое время ещё лучше подготовиться к пляжному сезону!',
      category: 'Sport',
      admin_id: 2,
      description: `
      Правда ли, что заниматься спортом лучше во второй половине дня? Или всё же утром? Медицинский редактор The Challenger рассказывает, когда лучше устроить тренировку, что такое загадочные циркадные ритмы и на что они влияют.
      Когда лучше заниматься спортом — утром или вечером? Как это часто бывает в медицине, правильного ответа на этот вопрос нет. Всё зависит от типа тренировки, привычек и особенностей вашего тела.
      Циркадные ритмы — что это?
      В течение суток в вашем организме происходят определённые изменения. Циркадными ритмами называют те из них, которые происходят циклически: день изо дня, с одной и той же закономерностью, с периодом около 24 часов. Таких колебаний в организме довольно много, но применительно к занятиям спортом наиболее интересны колебания температуры тела.
      Вопреки расхожему мнению, температура тела в норме не постоянная величина, которая равна 36,6 °C. В течение суток она колеблется в пределах 0,5 °С, достигая максимума после полудня и вечером. В утренние часы температура тела, наоборот, наименьшая.
      Другой показатель, относящийся к циркадным ритмам, — уровень кортизола в крови. Кортизол — это стероидный гормон, вырабатываемый надпочечниками, мобилизующий силы организма при стрессе или сильных нагрузках. Наибольший уровень кортизола наблюдается утром, когда он помогает организму проснуться. Ближе к вечеру уровень кортизола снижается.
      Есть и другие циркадные ритмы — например, уровень в крови мелатонина, колебания артериального давления и частоты сердцебиений. Все вместе они влияют на нашу работоспособность, активность и настроение.`,
    },
    {
      image: 'https://photo2.wambacdn.net/21/47/47/1755747412/1832025206_square.jpg?hash=PLnty8-qdB11LGr78X0BEA&expires=64060578000&updated=1516444254',
      title: '«World Class Таганский»',
      subtitle: 'Самое время ещё лучше подготовиться к пляжному сезону!',
      category: 'Sport',
      admin_id: 1,
      description: `
      Правда ли, что заниматься спортом лучше во второй половине дня? Или всё же утром? Медицинский редактор The Challenger рассказывает, когда лучше устроить тренировку, что такое загадочные циркадные ритмы и на что они влияют.
      Когда лучше заниматься спортом — утром или вечером? Как это часто бывает в медицине, правильного ответа на этот вопрос нет. Всё зависит от типа тренировки, привычек и особенностей вашего тела.
      Циркадные ритмы — что это?
      В течение суток в вашем организме происходят определённые изменения. Циркадными ритмами называют те из них, которые происходят циклически: день изо дня, с одной и той же закономерностью, с периодом около 24 часов. Таких колебаний в организме довольно много, но применительно к занятиям спортом наиболее интересны колебания температуры тела.
      Вопреки расхожему мнению, температура тела в норме не постоянная величина, которая равна 36,6 °C. В течение суток она колеблется в пределах 0,5 °С, достигая максимума после полудня и вечером. В утренние часы температура тела, наоборот, наименьшая.
      Другой показатель, относящийся к циркадным ритмам, — уровень кортизола в крови. Кортизол — это стероидный гормон, вырабатываемый надпочечниками, мобилизующий силы организма при стрессе или сильных нагрузках. Наибольший уровень кортизола наблюдается утром, когда он помогает организму проснуться. Ближе к вечеру уровень кортизола снижается.
      Есть и другие циркадные ритмы — например, уровень в крови мелатонина, колебания артериального давления и частоты сердцебиений. Все вместе они влияют на нашу работоспособность, активность и настроение.`,
    },
    {
      image: 'https://photo2.wambacdn.net/21/47/47/1755747412/1832025206_square.jpg?hash=PLnty8-qdB11LGr78X0BEA&expires=64060578000&updated=1516444254',
      title: '«World Class Таганский»',
      subtitle: 'Самое время ещё лучше подготовиться к пляжному сезону!',
      category: 'Sport',
      admin_id: 3,
      description: `
      Правда ли, что заниматься спортом лучше во второй половине дня? Или всё же утром? Медицинский редактор The Challenger рассказывает, когда лучше устроить тренировку, что такое загадочные циркадные ритмы и на что они влияют.
      Когда лучше заниматься спортом — утром или вечером? Как это часто бывает в медицине, правильного ответа на этот вопрос нет. Всё зависит от типа тренировки, привычек и особенностей вашего тела.
      Циркадные ритмы — что это?
      В течение суток в вашем организме происходят определённые изменения. Циркадными ритмами называют те из них, которые происходят циклически: день изо дня, с одной и той же закономерностью, с периодом около 24 часов. Таких колебаний в организме довольно много, но применительно к занятиям спортом наиболее интересны колебания температуры тела.
      Вопреки расхожему мнению, температура тела в норме не постоянная величина, которая равна 36,6 °C. В течение суток она колеблется в пределах 0,5 °С, достигая максимума после полудня и вечером. В утренние часы температура тела, наоборот, наименьшая.
      Другой показатель, относящийся к циркадным ритмам, — уровень кортизола в крови. Кортизол — это стероидный гормон, вырабатываемый надпочечниками, мобилизующий силы организма при стрессе или сильных нагрузках. Наибольший уровень кортизола наблюдается утром, когда он помогает организму проснуться. Ближе к вечеру уровень кортизола снижается.
      Есть и другие циркадные ритмы — например, уровень в крови мелатонина, колебания артериального давления и частоты сердцебиений. Все вместе они влияют на нашу работоспособность, активность и настроение.`,
    },
    {
      image: 'https://photo2.wambacdn.net/21/47/47/1755747412/1832025206_square.jpg?hash=PLnty8-qdB11LGr78X0BEA&expires=64060578000&updated=1516444254',
      title: '«World Class Таганский»',
      subtitle: 'Самое время ещё лучше подготовиться к пляжному сезону!',
      category: 'Sport',
      admin_id: 2,
      description: `
      Правда ли, что заниматься спортом лучше во второй половине дня? Или всё же утром? Медицинский редактор The Challenger рассказывает, когда лучше устроить тренировку, что такое загадочные циркадные ритмы и на что они влияют.
      Когда лучше заниматься спортом — утром или вечером? Как это часто бывает в медицине, правильного ответа на этот вопрос нет. Всё зависит от типа тренировки, привычек и особенностей вашего тела.
      Циркадные ритмы — что это?
      В течение суток в вашем организме происходят определённые изменения. Циркадными ритмами называют те из них, которые происходят циклически: день изо дня, с одной и той же закономерностью, с периодом около 24 часов. Таких колебаний в организме довольно много, но применительно к занятиям спортом наиболее интересны колебания температуры тела.
      Вопреки расхожему мнению, температура тела в норме не постоянная величина, которая равна 36,6 °C. В течение суток она колеблется в пределах 0,5 °С, достигая максимума после полудня и вечером. В утренние часы температура тела, наоборот, наименьшая.
      Другой показатель, относящийся к циркадным ритмам, — уровень кортизола в крови. Кортизол — это стероидный гормон, вырабатываемый надпочечниками, мобилизующий силы организма при стрессе или сильных нагрузках. Наибольший уровень кортизола наблюдается утром, когда он помогает организму проснуться. Ближе к вечеру уровень кортизола снижается.
      Есть и другие циркадные ритмы — например, уровень в крови мелатонина, колебания артериального давления и частоты сердцебиений. Все вместе они влияют на нашу работоспособность, активность и настроение.`,
    },
    {
      image: 'https://photo2.wambacdn.net/21/47/47/1755747412/1832025206_square.jpg?hash=PLnty8-qdB11LGr78X0BEA&expires=64060578000&updated=1516444254',
      title: '«World Class Таганский»',
      subtitle: 'Самое время ещё лучше подготовиться к пляжному сезону!',
      category: 'Sport',
      admin_id: 3,
      description: `
      Правда ли, что заниматься спортом лучше во второй половине дня? Или всё же утром? Медицинский редактор The Challenger рассказывает, когда лучше устроить тренировку, что такое загадочные циркадные ритмы и на что они влияют.
      Когда лучше заниматься спортом — утром или вечером? Как это часто бывает в медицине, правильного ответа на этот вопрос нет. Всё зависит от типа тренировки, привычек и особенностей вашего тела.
      Циркадные ритмы — что это?
      В течение суток в вашем организме происходят определённые изменения. Циркадными ритмами называют те из них, которые происходят циклически: день изо дня, с одной и той же закономерностью, с периодом около 24 часов. Таких колебаний в организме довольно много, но применительно к занятиям спортом наиболее интересны колебания температуры тела.
      Вопреки расхожему мнению, температура тела в норме не постоянная величина, которая равна 36,6 °C. В течение суток она колеблется в пределах 0,5 °С, достигая максимума после полудня и вечером. В утренние часы температура тела, наоборот, наименьшая.
      Другой показатель, относящийся к циркадным ритмам, — уровень кортизола в крови. Кортизол — это стероидный гормон, вырабатываемый надпочечниками, мобилизующий силы организма при стрессе или сильных нагрузках. Наибольший уровень кортизола наблюдается утром, когда он помогает организму проснуться. Ближе к вечеру уровень кортизола снижается.
      Есть и другие циркадные ритмы — например, уровень в крови мелатонина, колебания артериального давления и частоты сердцебиений. Все вместе они влияют на нашу работоспособность, активность и настроение.`,
    },
    {
      image: 'https://photo2.wambacdn.net/21/47/47/1755747412/1832025206_square.jpg?hash=PLnty8-qdB11LGr78X0BEA&expires=64060578000&updated=1516444254',
      title: '«World Class Таганский»',
      subtitle: 'Самое время ещё лучше подготовиться к пляжному сезону!',
      category: 'Sport',
      admin_id: 1,
      description: `
      Правда ли, что заниматься спортом лучше во второй половине дня? Или всё же утром? Медицинский редактор The Challenger рассказывает, когда лучше устроить тренировку, что такое загадочные циркадные ритмы и на что они влияют.
      Когда лучше заниматься спортом — утром или вечером? Как это часто бывает в медицине, правильного ответа на этот вопрос нет. Всё зависит от типа тренировки, привычек и особенностей вашего тела.
      Циркадные ритмы — что это?
      В течение суток в вашем организме происходят определённые изменения. Циркадными ритмами называют те из них, которые происходят циклически: день изо дня, с одной и той же закономерностью, с периодом около 24 часов. Таких колебаний в организме довольно много, но применительно к занятиям спортом наиболее интересны колебания температуры тела.
      Вопреки расхожему мнению, температура тела в норме не постоянная величина, которая равна 36,6 °C. В течение суток она колеблется в пределах 0,5 °С, достигая максимума после полудня и вечером. В утренние часы температура тела, наоборот, наименьшая.
      Другой показатель, относящийся к циркадным ритмам, — уровень кортизола в крови. Кортизол — это стероидный гормон, вырабатываемый надпочечниками, мобилизующий силы организма при стрессе или сильных нагрузках. Наибольший уровень кортизола наблюдается утром, когда он помогает организму проснуться. Ближе к вечеру уровень кортизола снижается.
      Есть и другие циркадные ритмы — например, уровень в крови мелатонина, колебания артериального давления и частоты сердцебиений. Все вместе они влияют на нашу работоспособность, активность и настроение.`,
    },
    {
      image: 'https://photo2.wambacdn.net/21/47/47/1755747412/1832025206_square.jpg?hash=PLnty8-qdB11LGr78X0BEA&expires=64060578000&updated=1516444254',
      title: '«World Class Таганский»',
      subtitle: 'Самое время ещё лучше подготовиться к пляжному сезону!',
      category: 'Sport',
      admin_id: 3,
      description: `
      Правда ли, что заниматься спортом лучше во второй половине дня? Или всё же утром? Медицинский редактор The Challenger рассказывает, когда лучше устроить тренировку, что такое загадочные циркадные ритмы и на что они влияют.
      Когда лучше заниматься спортом — утром или вечером? Как это часто бывает в медицине, правильного ответа на этот вопрос нет. Всё зависит от типа тренировки, привычек и особенностей вашего тела.
      Циркадные ритмы — что это?
      В течение суток в вашем организме происходят определённые изменения. Циркадными ритмами называют те из них, которые происходят циклически: день изо дня, с одной и той же закономерностью, с периодом около 24 часов. Таких колебаний в организме довольно много, но применительно к занятиям спортом наиболее интересны колебания температуры тела.
      Вопреки расхожему мнению, температура тела в норме не постоянная величина, которая равна 36,6 °C. В течение суток она колеблется в пределах 0,5 °С, достигая максимума после полудня и вечером. В утренние часы температура тела, наоборот, наименьшая.
      Другой показатель, относящийся к циркадным ритмам, — уровень кортизола в крови. Кортизол — это стероидный гормон, вырабатываемый надпочечниками, мобилизующий силы организма при стрессе или сильных нагрузках. Наибольший уровень кортизола наблюдается утром, когда он помогает организму проснуться. Ближе к вечеру уровень кортизола снижается.
      Есть и другие циркадные ритмы — например, уровень в крови мелатонина, колебания артериального давления и частоты сердцебиений. Все вместе они влияют на нашу работоспособность, активность и настроение.`,
    },
    ], {});
  },

  async down(queryInterface, Sequelize) {
    await queryInterface.bulkDelete('Communities', null, {});
  },
};
